# 3.	გამოიყენეთ ecommerce_orders_dirty.xlsx ფაილი. ონლაინ შეკვეთების ფაილში გაასუფთავეთ Category, Quantity,
# Unit_Price, Discount_%, Customer_Rating და Returned სვეტები, გაასწორეთ კატეგორიების სახელების ფორმატი, ტექსტური
# რიცხვები გადააქციეთ რიცხვებად, იპოვეთ არარეალური ფასდაკლებები და რეიტინგები, შემდეგ გამოთვალეთ თითოეული შეკვეთის
# საბოლოო ღირებულება ფასდაკლების გათვალისწინებით, pandas-ით დააჯგუფეთ მონაცემები კატეგორიების მიხედვით და დათვალეთ
# საშუალო ფასი, საშუალო რეიტინგი და დაბრუნების რაოდენობა, ხოლო matplotlib-ით ააგეთ კატეგორიების მიხედვით გაყიდვების და
# დაბრუნებების შედარებითი დიაგრამა.

import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_excel('data/ecommerce_orders_dirty.xlsx', header=2)
print(df.to_string())


